/*
static	int g_val = 2020;
{
	{
		int num = 10
	}	//num的作用域只限定在这个大括号里面
		
	printf("num = %d\n", num);//所以打印不了，对调就可以用。
}
int Add(int x, int y)
{
	int z = x + y;
	return z;

}*/


//生命周期，局部变量进作用域（{）开始，出作用域（}）结束。

//全局，就是main函数的生命周期，也就是整个程序的生命周期。

//视图，解决方案资源管理器。

//局部变量，不一定都是放在main函数里面。放在大括号里面的变量都是局部变量。

//常量，1，字面常量，2，const修饰的常量；3，#define 定义的标识符常量

//4，枚举常量	枚举列举的常量是不可以更改的。枚举类型后面跟的变量是可以更改的。

////字符串的结束标志 是 \0 的转义字符！！！！！！
/*
可以把一组字符串，放到一个数组里面。数组，一组数字。

打印字符串，要用%s

调试————窗口1————监视

int main()
{
	char arr1[] = "abc";			a b c \0
	char arr2[] = 'a','b','c';		a	b	c
	printf("%s\n",arr1);
	printf("%s\n",arr2);			arr2 大括里，加个0
	return 0;

}
\0,字符串的结束标志是\0,值是0.放个\0可以，放个0，也可以。	\0作为字符串结束标志，不算字符串内容。

数据在计算机上存储的是二进制。那字符’a’的值是多少呢。

给每个字符编了一个值的编码方式，叫ASCII 编码，对应的值叫做----阿斯克码值。

//arr2,strlen 往后找，直到在随机值里面找到了一个\0,答案，随机值。
再次重申！\0 之于字符串特别的重要！

什么叫转义字符。转变原来的意思。

int main()
{
	printf("abcn");
	//然后再打印printf("abc\n");
	return 0;//\n 就把原来一个普通字符n的意思转变了，换成了换行的意思。
}

//\n 就把原来一个普通字符n的意思转变了，换成了换行的意思。
请按任意键继续在它的后面]，没有换行的效果。

int main()
{
	printf("D:\学CVS2019\项目\Project2");
	return 0;
}

少了一个 t ，说明 \t，改变了t的意思。变成了长长的空白，——水平制表符。
\t 水平制表符。意味着在输出中间，添加了一块儿 水平制表符这样一块空间的大小。

？？）被解析成了一个中括号。早期语法里，有三字母词这样一个概念。

int main()
{
	printf("(are you ok??)");//改成——————printf("(are you ok\?\?)");
	return 0;
}

int main()
{
	printf("c:\test\32\test.c");

	//更改方法；printf("c:\\test\\32\\test.c");

	return 0;
}

\ 还可以转义 \ ,让 \ 表示为普通的 \ 。
\ 表示为一个反斜杠，防止它被解释为一个转义序列符里面的 \，参考转义字符表

引一个<string.h>的头文件。


int main()
{
	printf("%c\n",'\'');	//会把''解析成引字符的那两个单引号。如'a'，
	return 0;
}
int main()
{
	printf("%s\n","\"");
	return 0;
}

int main()
{
	printf("%d\n",string(c:\test\32\test.c));//13
	return 0;
}
			\ddd		32 ,是两个八进制数字..32作为8进制代表的10进制数字——作为ASCII码值———所对应的字符。
	
int main()
{
	printf("%d\n",string(c:\test\32\test.c));//13
	return 0;
}

int main()
{
	printf("%c\n",'\32');//→
	
	//	\132 = 1*8^2 + 3*8^1 + 2*8^0 = 90,参考ASCII码值表，对应的是Z。
	
	return 0;
}

只要是键盘上任意一个能出来的都算字符，逗号，冒号等

		\xdd dd	这两个16进制数字, 转换成10进制数字之后，作为ASCII码值所对应的字符。

int main()
{
		printf("%d\n",\x16);
	return 0;

}
注释。英文\斜杠。











































*/
